# Задача 2
#
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

num = input("Введите трехзначное число: ")

print(int(num) // 100 + int(num) // 10 % 10 + int(num) % 10) if (num.isdigit() and int(num) in range(100, 999)) \
    else print("Неверный ввод")
