prophecies = [
    "в Новом году вас ждет много приятных сюрпризов. Возможно, вам захочется поменять работу или же отправиться в путешествие. \
    А может быть, вы вдруг решите приобрести что-то из мебели или бытовой техники. Если вы еще не определилась с выбором, то в начале года стоит подумать об этом.",
    "в Новом году вам не стоит бояться перемен. Скорее всего, они принесут только пользу и радость. Однако не спешите принимать решения: прислушайся к своему внутреннему голосу.",
    "в Новом году вас ждет много новых впечатлений, радостных встреч и приятных событий.",
    "в Новом году вас ждет много сюрпризов! Если вы хотите, чтобы все они были приятными, обязательно заведите КОЛЛИ) Если у вас она есть - еще одну. ",
    "в Новом году вас ждет много приятных сюрпризов, а все потому, что вы – необыкновенный человек! \ С каждым днем вы становитесь мудрее, сильнее и увереннее в себе. \
    Нужно всего лишь быть внимательным к мелочам, но не забывать о главной цели.",
    "все, что вы сделаете в Новом году, пойдет вам на пользу. Вы можете сделать много хорошего для других людей. Но если вы будете действовать необдуманно, \
    то можете навредить себе. Не торопитесь.",
    "в Новом году вас ждет множество перемен. Появится возможность сделать то, что казалось нереальным.",
    "в Новом году вы узнаете то, о чем раньше и не догадывались. \
    Начнется все с вашего нового взгляда на окружающий мир. А затем вы поймете, что вам давно уже не нужно было делать то, к чему вы привыкли.",
    "в Новом году вас ждет много интересного. \
    У вас будет и трудная работа, и новые интересные знакомства, и даже новые увлечения. \
    Но это не значит, что нужно забывать о старых друзьях.",
    "в Новом году вас ждет много новых впечатлений. Вы узнаете много нового, научитесь тому, что раньше не умели.",
    "в Новом году вас ждет много сюрпризов. Это и подарки, и новые возможности, и удивительные приключения. Не стоит сидеть на месте, следует активно действовать.",
    "год будет очень плодотворным для вас. Вы сможете завести новые знакомства, получить много новых впечатлений и эмоций от путешествий.",
    "вам будет везти во всех делах, поэтому вы можете смело ставить перед собой цели и добиваться их.",
    "в этом году у вас будет возможность реализовать все свои мечты, главное — верить в себя и не отступать. Не бойтесь перемен, и тогда вы сможете достичь желаемого.",
    "в Новом году вас ждет еще больше крутых идей, открытий и знаний. И самое главное — вы найдете в себе силы, чтобы сделать то, что давно хотели, но не решались.",
    "в Новом году вам предстоит много работы и новых свершений. Вы с удовольствием будете делать то, что любите, и получать от этого удовольствие. Ваши действия будут успешными. \
    А люди вокруг будут помогать вам в этом.",
    "в Новом году стоит заняться саморазвитием и посвятить время самообразованию. Это поможет вам найти себя и открыть новые таланты.",
    "будьте открыты новым возможностям и смело следуйте к своим целям.",
    "в Новом году вы сможете найти новых друзей, которые будут очень близки вам по духу. Если у вас есть какие-то старые знакомые, с которыми вы давно не виделись, то в этом году вы сможете наладить с ними отношения.",
    "в Новом году вас ждет большой успех, и все дела пойдут в гору. Ваши мысли будут чисты и верны, вы сможете добиться успеха благодаря своей настойчивости.",
    "в Новом году вас ждут новые интересные знакомства, которые принесут вам пользу и благополучие.",
    "в Новом году вас ждет много хорошего и даже больше, чем вы ожидаете. Но если вы будете ждать от года чего-то необычного, то он преподнесет вам не совсем то, что вы ожидали.",
    "в Новом году вас ждет много работы, которая будет вам по душе. Не бойтесь браться за серьезные дела, вы с ними справитесь, и уже в скором времени вас ждут хорошие перспективы. \
    Работайте, работайте и еще раз работайте.",
    "в Новом году вас ждет счастье. Вы сможете реализовать все задуманное и добиться поставленных целей, но для этого придется потрудиться. \
    Будьте готовы к тому, что вам придется проявить волю и характер.",
    "в Новом году вас ждет карьерный рост и исполнение заветной мечты. Не упустите этот шанс и уже на следующий день после праздника начните действовать.",
    "в Новом году вас ждет сюрприз. Примите его с благодарностью.",
    "в Новом году вас ждет много событий, которые будут способствовать вашему росту и развитию. \
    Вы будете двигаться вперед, несмотря на препятствия, но только если будете сохранять спокойствие и терпение. \
    Будьте готовы к большим переменам и новым знакомствам, не бойтесь новых отношений, они помогут вам стать более уверенным в себе.",

]
